#!/bin/bash
source /etc/profile

cd /root/blob/

echo "----------------------------------开始更新仓库------------------------------------"

pullNum=`git pull origin main | grep up-to-date | wc -l`

echo "-------------------------------仓库更新完毕开始编译环境---------------------------------"

if [ $pullNum -eq 1 ]
then
  echo "------------------------------本次提交没有更改内容----------------------------------"
else
  hexo clean && hexo g
  echo "-----------------------------------编译完毕-------------------------------------"
fi

modifiedNum=`git status | grep modified | wc -l`

if [ $modifiedNum -gt 0 ]
then
  echo "------------------------------文章生成自动标识提交----------------------------------"
  git commit -a -m '[auto] 文章生成唯一标识'
  git push origin main
  echo "---------------------------------提交完成-------------------------------------"
fi

